#include <iostream>

// 1. 컴파일이란?
	// C++ 코드에 적힌 내용들을 0과 1로 이루어진 데이터로 바꿔서 실행 파일(.exe)을 만드는 과정
	
// 2. 컴파일러란?
	// 우리가 작성한 c++ 코드를 읽고
	// 문법이 맞는지 확인하고
	// 그 내용을 컴퓨터가 이해할수 있도록 0과 1로 된 명령어들로 바꿔줍니다.

int main(void)
{
	// 3.Visual Studio 환경에서 컴파일을 진행하고 실행해보려면?
		// F7 키는 컴파일만 진행
		// F5 키는 컴파일과 실행을 모두 진행
	// 4.컴파일 에러란?
		// 컴파일이 중간에 멈추고
		// 실행 파일이 만들어지지 않으며
		// 반드시 고쳐야 다음 단계로 갈 수 있습니다.	
		/*int a = 10
		printf("%d\n", a);
		return 0;*/
	// 5.Warning이란?
		// 지금은 괜찮아 보이지만, 조심하는 게 좋습니다.
	double pi = 3.14;
	int value = pi;
	printf("%d\n", value);
	return 0;
}

// 마지막 정리
/*
* 결국 컴퓨터는 0과 1만 이해하고 있고,
이 0과 1들을 용도에 따라 자료형으로 구분해두었습니다.

*우리가 작성한 C++ 코드는 바로 이 자료형들을 다뤄서,
“이렇게 계산해 주세요”, “이 값을 저장해 주세요”라는
우리의 의도를 컴퓨터에게 전달하려는 것입니다.

*그 의도를 0과 1의 형태로 바꿔주는 과정이 컴파일이고,
그 번역기 역할을 하는 것이 바로 컴파일러입니다.
*/